source/DataProcessors/VKRPanel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>VKRPanel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

source/InformationRegisters/VKRQueue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRQueue</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Attempts</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NextTry</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimUntil</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastError</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/DataProcessors/VKRPanel/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.КнопкаDemo.Видимость = ПравоДоступа("Администрирование", Метаданные);
    ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Refresh(Команда)
    ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Check(Команда)
    ПроверитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Demo(Команда)
    ПоказатьВопрос(Новый ОписаниеОповещения("ПослеПодтвержденияДанных", ЭтотОбъект),
        "Создать учебный набор: 10 сотрудников, 60 кадровых событий и 120 уведомлений? Кадровые документы относятся к 10–15 августа 2026 года.", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияДанных(Ответ, ДополнительныеПараметры) Экспорт
    Если Ответ = КодВозвратаДиалога.Да Тогда
        СоздатьДанныеНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Enable(Команда)
    УстановитьОтправкуНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Disable(Команда)
    УстановитьОтправкуНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Process(Команда)
    VKRJobs.ВыполнитьЦикл();
    ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Retry(Команда)
    ПоказатьВопрос(Новый ОписаниеОповещения("ПослеРешения", ЭтотОбъект, "Retry"),
        "Повторить отправку? Проверьте приёмник и укажите результат проверки в основании решения.", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Cancel(Команда)
    ПоказатьВопрос(Новый ОписаниеОповещения("ПослеРешения", ЭтотОбъект, "Cancel"),
        "Прекратить обработку выбранного уведомления?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРешения(Ответ, Решение) Экспорт
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ПринятьРешениеНаСервере(Решение);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПринятьРешениеНаСервере(Знач Решение)
    VKROperator.Решить(Уведомление, Решение, Обоснование);
    ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтправкуНаСервере(Знач Включить)
    Если НЕ ПравоДоступа("Изменение", Метаданные.Константы.VKRSendEnabled) Тогда
        ВызватьИсключение "Недостаточно прав для управления отправкой.";
    КонецЕсли;
    Если Включить Тогда
        VKRMail.ПараметрыСоединения();
    КонецЕсли;
    Константы.VKRSendEnabled.Установить(Включить);
    ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДанныеНаСервере()
    Результат = VKRDemo.Создать();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
    Таблица = VKRSelfTests.ВыполнитьПроверки();
    Результат = "ПРОВЕРКА АЛГОРИТМОВ" + Символы.ПС;
    Для Каждого СтрокаТеста Из Таблица Цикл
        Результат = Результат + ?(СтрокаТеста.Успех, "ПРОЙДЕН: ", "ОШИБКА: ")
            + СтрокаТеста.Тест + Символы.ПС + СтрокаТеста.Подробности + Символы.ПС;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
    Результат = "Обработка очереди: " + ?(Константы.VKRSendEnabled.Получить(), "включена", "остановлена") + Символы.ПС;
    Запрос = Новый Запрос("ВЫБРАТЬ О.State КАК Состояние, КОЛИЧЕСТВО(*) КАК Количество
        |ИЗ РегистрСведений.VKRQueue КАК О СГРУППИРОВАТЬ ПО О.State");
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат = Результат + Строка(Выборка.Состояние) + ": " + Строка(Выборка.Количество) + Символы.ПС;
    КонецЦикла;
    Если ЗначениеЗаполнено(Уведомление) Тогда
        О = РегистрыСведений.VKRQueue.СоздатьМенеджерЗаписи();
        О.Notification = Уведомление;
        О.Прочитать();
        Если О.Выбран() Тогда
            Результат = Результат + Символы.ПС + "Выбранное уведомление: " + Строка(Уведомление)
                + Символы.ПС + "Адрес: " + Уведомление.Email + Символы.ПС
                + "Состояние: " + Строка(О.State) + "; попыток: " + Строка(О.Attempts)
                + Символы.ПС + "Последняя ошибка: " + О.LastError;
        Иначе
            Результат = Результат + Символы.ПС + "В новой очереди нет выбранного уведомления.";
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
